[
  {
    "version": "1.4.0",
    "name": "Release 4",
    "date": "June 3, 2022",
    "data": [
      "Features",
      [
        "Your muscles are the only thing getting gains… Extreme performance gains coming too.",
        [
          "The old method of rendering the ongoing workout page meant that on every change (even something as small as writing 1 number) the entire page would be re-rendered.",
          "Through caching and memoization of components, your device no longer re-renders the entire list, and only re-renders items when their own data has changed.",
          "This should mean potentially 2-5x gains on performance depending on the length and complexity of your workouts."
        ],
        "Added input for choosing custom colors using hex codes.",
        [
          "This works with the built in color picker wheel, and you can choose either one."
        ]
      ],
      "Bug Fixes",
      [
        "Fixed notes field not expanding downward when a note is barely longer than 1 line.",
        "Fixed the history page displaying all workouts as “0min long” (Again… first fix didn't work ¯\\_(ツ)_/¯)"
      ]
    ]
  },
  {
    "version": "1.3.2",
    "name": "Release 3 - Patch 2",
    "date": "June 1, 2022",
    "data": [
      "This was simply a hotfix to patch up a huge error in the previous version.",
      "Bug Fixes",
      [
        "The implementation of multi-set reuse caused the app to crash upon editing any superset 😅😅. Re-wrote the codebase for reuse to be much more stable.",
        "Fixed bug where using quick start would create an infinite loading page.",
        "Fixed visual bug with the 'No Routines' alert."
      ],
      "Very small update for today, but the next release is nearly ready for release and it brings some badly needed changes, can't wait to show it!"
    ]
  },
  {
    "version": "1.3.1",
    "name": "Release 3 - Patch 1",
    "date": "June 1, 2022",
    "data": [
      "Features",
      [
        "You can now set autofill all sets of an exercise at once.",
        [
          "Simply swipe on the name of an exercise to bring up a Multi-Set Reuse menu. It works exactly the same as for single sets, but it will autofill all sets of that exercise."
        ]
      ],
      "Bug Fixes",
      [
        "Fixed the history page displaying all workouts as “0min long”",
        "Fixed issue where turning a workout with supersets into a preset resulted in the supersets becoming “undefined”",
        "Fixed visual bugs with the notes field not displaying multi-line notes."
      ],
      "Misc",
      [
        "Changed all references of “autofill” to “set reuse” to more accurately describe what it is."
      ]
    ]
  },
  {
    "version": "1.3.0",
    "name": "Release 3",
    "date": "May 31, 2022",
    "data": [
      "Features",
      [
        "Set Autofill!",
        [
          "If you want to copy the data from your previous workout's set, you can now simply slide the set to the right to reveal an autofill menu.",
          "This is customizable in settings for if you want the autofill to overwrite current data or not."
        ],
        "“Quick Start” button on the homepage",
        [
          "Allows you to jump into a workout without having to create a preset."
        ],
        "“Turn Into Preset” option for past workouts.",
        [
          "Allows you to create a reusable preset from any of your past workouts instead of having to make all of your presets beforehand."
        ]
      ]
    ]
  },
  {
    "version": "1.2.2",
    "name": "Release 2 - Patch 2",
    "date": "May 29, 2022",
    "data": [
      "Bug Fixes",
      [
        "Fixed crash when attempting to view settings of an exercise with no data.",
        "Fixed count weight twice setting applying to all exercises instead of being exercise specific."
      ],
      "Misc",
      [
        "Moved the “Delete Exercise” button from the exercise view page to within an exercise's settings."
      ]
    ]
  },
  {
    "version": "1.2.1",
    "name": "Release 2 - Patch 1",
    "date": "May 29, 2022",
    "data": [
      "Features",
      [
        "New exercise settings menu located in the same place as exercise stats.",
        "Option to count an exercise's weight twice in exercise stats",
        ["(for exercises where the weight you log is only one arm/leg's worth)"]
      ],
      "Bug Fixes",
      [
        "Fixed crash when deleting the last set of a superset",
        "Fixed incorrect end time being entered when ending a workout while you still have empty fields.",
        "Fixed flickering on the note field of a set.",
        "Fixed notes field of a workout getting cut off after the first line."
      ],
      "Misc",
      [
        "Weight/rep targets now display fractions instead of decimals.",
        "Many small visual tweaks/size adjustments."
      ]
    ]
  },
  {
    "version": "1.2.0",
    "name": "Release 2",
    "date": "May 28, 2022",
    "data": [
      "Features",
      [
        "View your past exercise data! Clicking on an exercise in the “Your Exercises” category will bring up a new menu that has multiple screens.",
        [
          "Overview: View a small amount of quick stats about that exercise, like your total sets/reps/weights done for that exercise.",
          "Past Workouts: A detailed breakdown showing each set of each workout containing the exercise.",
          "Graphs: Graphs showing your weights and reps for that exercise have changed over time."
        ],
        "Custom Themes. You can now choose the “Custom” option in the theme settings, which gives you the ability to customize each colour in the app.",
        [
          "Share your themes with others using the built-in “Share” and “Import” buttons"
        ],
        "Settings toggle to choose between LBS and KG for your weight unit."
      ],
      "Bug Fixes",
      ["Fixed crash when attempting to end a workout with a superset in it."],
      "Misc",
      [
        "You can now delete entries in your exercise history if you misreported or just don't feel proud of one set."
      ]
    ]
  },
  {
    "version": "1.1.4",
    "name": "Release 1 - Patch 4",
    "date": "May 27, 2022",
    "data": ["Misc", ["Renamed to Liftris"]]
  },
  {
    "version": "1.1.3",
    "name": "Release 1 - Patch 3",
    "date": "May 25, 2022",
    "data": [
      "Bug Fixes",
      [
        "Fixed issue where history entries were added oldest-first instead of newest-first,",
        "Reformatted how exercise history is organized, this will make it much easier in the future to chart and organize."
      ]
    ]
  },
  {
    "version": "1.1.2",
    "name": "Release 1 - Patch 2",
    "date": "May 25, 2022",
    "data": [
      "Features",
      [
        "Gave all modals in the app pop-up animation, and the ability to swipe up or down to close them in addition to clicking on the background.",
        ["Doesn't include confirmation modals"]
      ],
      "Bug Fixes",
      [
        "Fixed crash when attempting to add to superset at the end of a workout",
        "Fixed padding bug with StatDiffChips on the rep field"
      ]
    ]
  },
  {
    "version": "1.1.1",
    "name": "Release 1 - Patch 1",
    "date": "May 25, 2022",
    "data": [
      "Bug Fixes",
      [
        "Fixed crash when attempting to add to superset at the end of a workout",
        "Fixed padding bug with StatDiffChips on the rep field"
      ]
    ]
  },
  {
    "version": "1.1.0",
    "name": "Release 1",
    "date": "May 24, 2022",
    "data": [
      "We are live! (Well not really because this release was superseded before it ever got approved but still)",
      "Features",
      [
        "Added creating, editing, and deleting routines",
        "Added filling out, submitting, and viewing workouts",
        "Added creating custom exercises",
        "Given that this is the first release, it's somewhat barebones, but all of the internal code for many of the more advanced Features is already in, so it should be relatively simple to add them later."
      ]
    ]
  }
]
